assets/Snowflake Hybrid Tables.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Hybrid Tables Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NUMBER_OF_KEYS" elementType="Argument">
            <stringProp name="Argument.name">NUMBER_OF_KEYS</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.desc">The number of keys to sample for each loop to iterate on.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NUMBER_OF_THREADS" elementType="Argument">
            <stringProp name="Argument.name">NUMBER_OF_THREADS</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ACCOUNT_LOCATOR" elementType="Argument">
            <stringProp name="Argument.name">ACCOUNT_LOCATOR</stringProp>
            <stringProp name="Argument.value">(put your locator here)</stringProp>
            <stringProp name="Argument.desc">The account locator (without snowflakecomputing.com)</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="WAREHOUSE_NAME" elementType="Argument">
            <stringProp name="Argument.name">WAREHOUSE_NAME</stringProp>
            <stringProp name="Argument.value">HYBRID_QUICKSTART_WH</stringProp>
            <stringProp name="Argument.desc">The Snowflake warehouse used for hybrid table testing.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DATABASE_NAME" elementType="Argument">
            <stringProp name="Argument.name">DATABASE_NAME</stringProp>
            <stringProp name="Argument.value">HYBRID_QUICKSTART_DB</stringProp>
            <stringProp name="Argument.desc">The database to use for testing.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SCHEMA_NAME" elementType="Argument">
            <stringProp name="Argument.name">SCHEMA_NAME</stringProp>
            <stringProp name="Argument.value">DATA</stringProp>
            <stringProp name="Argument.desc">The schema name to use when connecting</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USER_NAME" elementType="Argument">
            <stringProp name="Argument.name">USER_NAME</stringProp>
            <stringProp name="Argument.value">HYBRID_QUICKSTART_USER</stringProp>
            <stringProp name="Argument.desc">The username to use when connecting</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ROLE_NAME" elementType="Argument">
            <stringProp name="Argument.name">ROLE_NAME</stringProp>
            <stringProp name="Argument.value">HYBRID_QUICKSTART_ROLE</stringProp>
            <stringProp name="Argument.desc">The role name to use when connecting</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRIVATE_KEY_FILE_PATH" elementType="Argument">
            <stringProp name="Argument.name">PRIVATE_KEY_FILE_PATH</stringProp>
            <stringProp name="Argument.value">(your path to private key)/privkey.pem</stringProp>
            <stringProp name="Argument.desc">The private key file name to use</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        <elementProp name="NUMBER_OF_TXNS" elementType="Argument"><stringProp name="Argument.name">NUMBER_OF_TXNS</stringProp><stringProp name="Argument.value">50</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="NUMBER_OF_TXN_THREADS" elementType="Argument"><stringProp name="Argument.name">NUMBER_OF_TXN_THREADS</stringProp><stringProp name="Argument.value">1</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="QUERY_TAG_SELECT" elementType="Argument"><stringProp name="Argument.name">QUERY_TAG_SELECT</stringProp><stringProp name="Argument.value">ht_qs_select</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="QUERY_TAG_TXN" elementType="Argument"><stringProp name="Argument.name">QUERY_TAG_TXN</stringProp><stringProp name="Argument.value">ht_qs_txn</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="QUERY_TAG_INVALID" elementType="Argument"><stringProp name="Argument.name">QUERY_TAG_INVALID</stringProp><stringProp name="Argument.value">ht_qs_invalid</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Snowflake JDBC">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">jdbcConfig</stringProp>
        <stringProp name="dbUrl">jdbc:snowflake://${ACCOUNT_LOCATOR}.snowflakecomputing.com</stringProp>
        <stringProp name="driver">net.snowflake.client.jdbc.SnowflakeDriver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="poolMax">0</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <boolProp name="preinit">false</boolProp>
        <stringProp name="initQuery">ALTER SESSION SET QUERY_TAG = '${QUERY_TAG_SELECT}'</stringProp>
        <stringProp name="connectionProperties">user=${USER_NAME};db=${DATABASE_NAME};schema=${SCHEMA_NAME};warehouse=${WAREHOUSE_NAME};role=${ROLE_NAME};private_key_file=${PRIVATE_KEY_FILE_PATH}</stringProp>
        <stringProp name="TestPlan.comments">Setup snowflake connection by adjusting the connection string as required.</stringProp>
      </JDBCDataSource>
      <hashTree />
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="RespTimeGraph.interval">100</stringProp>
        <stringProp name="RespTimeGraph.graphtitle">Response Time Graph</stringProp>
        <intProp name="RespTimeGraph.graphtitlefondsize">3</intProp>
        <intProp name="RespTimeGraph.linestrockwidth">2</intProp>
        <intProp name="RespTimeGraph.lineshapepoint">4</intProp>
        <intProp name="RespTimeGraph.legendsize">1</intProp>
        <stringProp name="RespTimeGraph.seriesselectionmatchlabel">.*Query</stringProp>
        <intProp name="RespTimeGraph.legendplacement">1</intProp>
        <boolProp name="RespTimeGraph.seriesselection">true</boolProp>
      </ResultCollector>
      <hashTree />
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="SELECT Thread Group">
        <stringProp name="TestPlan.comments">This thread group will issue SELECT commands</stringProp>
        <stringProp name="ThreadGroup.num_threads">${NUMBER_OF_THREADS}</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="false">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">true</boolProp>
        </DebugSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree />
        </hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Get IDs">
          <stringProp name="dataSource">jdbcConfig</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT ID FROM ICECREAM_ORDERS SAMPLE (${NUMBER_OF_KEYS} ROWS);</stringProp>
          <stringProp name="variableNames">ID</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">This request returns a sampling of keys we use to query the table with in subsequent loops.</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree />
        </hashTree>
        <ForeachController guiclass="ForeachControlPanel" testclass="ForeachController" testname="ForEachID">
          <stringProp name="ForeachController.inputVal">ID</stringProp>
          <stringProp name="ForeachController.returnVal">ID</stringProp>
          <boolProp name="ForeachController.useSeparator">true</boolProp>
        </ForeachController>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Orders Query">
            <stringProp name="dataSource">jdbcConfig</stringProp>
            <stringProp name="queryType">Prepared Select Statement</stringProp>
            <stringProp name="query">SELECT * FROM ICECREAM_ORDERS WHERE ID = ?</stringProp>
            <stringProp name="queryArguments">${ID}</stringProp>
            <stringProp name="queryArgumentsTypes">INTEGER</stringProp>
            <stringProp name="resultSetHandler">Store as Object</stringProp>
          </JDBCSampler>
          <hashTree>
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree />
            <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Lookup Response">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree />
          </hashTree>
        </hashTree>
      </hashTree>
    <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Snowflake JDBC TXN">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">jdbcTxn</stringProp>
        <stringProp name="dbUrl">jdbc:snowflake://${ACCOUNT_LOCATOR}.snowflakecomputing.com</stringProp>
        <stringProp name="driver">net.snowflake.client.jdbc.SnowflakeDriver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="poolMax">0</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <boolProp name="preinit">false</boolProp>
        <stringProp name="initQuery">ALTER SESSION SET QUERY_TAG = '${QUERY_TAG_TXN}'</stringProp>
        <stringProp name="connectionProperties">user=${USER_NAME};db=${DATABASE_NAME};schema=${SCHEMA_NAME};warehouse=${WAREHOUSE_NAME};role=${ROLE_NAME};private_key_file=${PRIVATE_KEY_FILE_PATH}</stringProp>
        <stringProp name="TestPlan.comments">Separate connection so this workload carries its own QUERY_TAG (${QUERY_TAG_TXN}), which is how the run is isolated in AGGREGATE_QUERY_HISTORY.</stringProp>
      </JDBCDataSource>
      <hashTree /><JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Snowflake JDBC INVALID">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">jdbcInvalid</stringProp>
        <stringProp name="dbUrl">jdbc:snowflake://${ACCOUNT_LOCATOR}.snowflakecomputing.com</stringProp>
        <stringProp name="driver">net.snowflake.client.jdbc.SnowflakeDriver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="poolMax">0</stringProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <boolProp name="preinit">false</boolProp>
        <stringProp name="initQuery">ALTER SESSION SET QUERY_TAG = '${QUERY_TAG_INVALID}'</stringProp>
        <stringProp name="connectionProperties">user=${USER_NAME};db=${DATABASE_NAME};schema=${SCHEMA_NAME};warehouse=${WAREHOUSE_NAME};role=${ROLE_NAME};private_key_file=${PRIVATE_KEY_FILE_PATH}</stringProp>
        <stringProp name="TestPlan.comments">Separate connection so this workload carries its own QUERY_TAG (${QUERY_TAG_INVALID}), which is how the run is isolated in AGGREGATE_QUERY_HISTORY.</stringProp>
      </JDBCDataSource>
      <hashTree /><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TRANSACTION Thread Group">
        <stringProp name="TestPlan.comments">Measures a multi-statement unit of work: the Inline Procedure updates an order and writes an audit row atomically. Kept separate from the SELECT group so the two workloads can be measured independently.</stringProp>
        <stringProp name="ThreadGroup.num_threads">${NUMBER_OF_TXN_THREADS}</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Get TXN IDs">
          <stringProp name="dataSource">jdbcTxn</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT ID FROM ICECREAM_ORDERS SAMPLE (${NUMBER_OF_TXNS} ROWS);</stringProp>
          <stringProp name="variableNames">TXN_ID</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">Samples the order keys the transaction workload will update.</stringProp>
        </JDBCSampler>
        <hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree /></hashTree><ForeachController guiclass="ForeachControlPanel" testclass="ForeachController" testname="ForEachTxnID"><stringProp name="ForeachController.inputVal">TXN_ID</stringProp><stringProp name="ForeachController.returnVal">TXN_ID</stringProp><boolProp name="ForeachController.useSeparator">true</boolProp></ForeachController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Update Scoops">
          <stringProp name="dataSource">jdbcTxn</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">CALL update_scoops(?, ?, ?)</stringProp>
          <stringProp name="queryArguments">${TXN_ID},${__Random(1,3)},${__time(yyyy-MM-dd HH:mm:ss)}</stringProp>
          <stringProp name="queryArgumentsTypes">INTEGER,INTEGER,TIMESTAMP</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">One round trip performs both writes. Bound parameters keep the query shape stable so the plan is reused.</stringProp>
        </JDBCSampler>
        <hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree /></hashTree></hashTree></hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="INVALID INPUT Thread Group" enabled="false">
        <stringProp name="TestPlan.comments">Deliberately failing calls live here, NOT in the measured groups. Shipped DISABLED because the Response Time Graph sits at test plan level and would otherwise fold these samples into the latency numbers. Enable it on its own to verify rollback, then disable it again before measuring.</stringProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Pick An Order">
          <stringProp name="dataSource">jdbcInvalid</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT ID AS INVALID_ORDER_ID, NUM_SCOOPS AS SCOOPS_BEFORE FROM ICECREAM_ORDERS ORDER BY ID LIMIT 1;</stringProp>
          <stringProp name="variableNames">INVALID_ORDER_ID,SCOOPS_BEFORE</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">Records the order's state before the failing call.</stringProp>
        </JDBCSampler>
        <hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree /></hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Invalid Scoops Call">
          <stringProp name="dataSource">jdbcInvalid</stringProp>
          <stringProp name="queryType">Callable Statement</stringProp>
          <stringProp name="query">CALL update_scoops(?, 0, ?)</stringProp>
          <stringProp name="queryArguments">${INVALID_ORDER_ID_1},${__time(yyyy-MM-dd HH:mm:ss)}</stringProp>
          <stringProp name="queryArgumentsTypes">INTEGER,TIMESTAMP</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">NEW_SCOOPS = 0 violates CHK_NEW_SCOOPS_POSITIVE, so the call fails and the whole unit must roll back.</stringProp>
        </JDBCSampler>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Expect CHECK Violation"><collectionProp name="Asserion.test_strings"><stringProp name="expected">1185</stringProp></collectionProp><stringProp name="Assertion.custom_message">Expected the call to fail with 1185</stringProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">2</intProp><stringProp name="TestPlan.comments">The call must fail on the CHECK constraint. JMeter puts the SQLSTATE and the vendor error code in the response code field (here '23514 1185'), so assert on the error number rather than the constraint name, which a reader may rename.</stringProp></ResponseAssertion><hashTree /><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree /></hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Verify No Partial Write">
          <stringProp name="dataSource">jdbcInvalid</stringProp>
          <stringProp name="queryType">Prepared Select Statement</stringProp>
          <stringProp name="query">SELECT CASE WHEN NUM_SCOOPS = ? THEN 'ROLLBACK_OK' ELSE 'PARTIAL_WRITE' END AS ROLLBACK_CHECK FROM ICECREAM_ORDERS WHERE ID = ?</stringProp>
          <stringProp name="queryArguments">${SCOOPS_BEFORE_1},${INVALID_ORDER_ID_1}</stringProp>
          <stringProp name="queryArgumentsTypes">INTEGER,INTEGER</stringProp>
          <stringProp name="resultSetHandler">Store as Object</stringProp>
          <stringProp name="TestPlan.comments">Confirms the order is unchanged after the failed call.</stringProp>
        </JDBCSampler>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Expect Rollback"><collectionProp name="Asserion.test_strings"><stringProp name="expected">ROLLBACK_OK</stringProp></collectionProp><stringProp name="Assertion.custom_message">Expected the call to fail with ROLLBACK_OK</stringProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">2</intProp><stringProp name="TestPlan.comments">Proves the UPDATE did not persist even though it ran before the failing INSERT.</stringProp></ResponseAssertion><hashTree /><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree /></hashTree></hashTree></hashTree>
  </hashTree>
</jmeterTestPlan>